
# TODO add support for function calls
# TODO  add support for Classes printing their name
# TODO  add support for درصورت مشاهده فراخوانی تابع باید نام تایع به همراه آرگومان های ارسالی به عنوان پارامتر چاپ شود.
# TODO  add support for  . جلوگیری از تعریف کلاس یا فانکشن با نام مشابه در یک اسکوپ غیر قانونی
#2 . جلوگیری از تعریف متغییر با نام مشابه در یک اسکوپ غیر قانونی TODO
# TODO 3 . نشان دادن خطای آرگومان اشتباه هنگام پاس دادن مقادیر اشتباه در زمان فراخوانی توابع
# TODO 4 . عدم وجود وابستگی حلقوی در دو کلاس